//LOPALL  JOB (ACCT),'PARMLOP C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMLOP
//* FUENTE : IBMUSER.COBOL.SRC(PARMLOP)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMLOP)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMLOP),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMLOP),DISP=SHR
//*
//RUN     EXEC PGM=PARMLOP,COND=(0,NE)
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
MENSAJE REPETIDO DESDE SYSIN
/*
//
