//VERCLIM JOB (ACCT),'VERIFY CLIENTE',CLASS=A,MSGCLASS=X
//*
//* VERIFICA DATASET Y LECTURA DEL MIEMBRO CLIENTE1
//* UTILIDADES: IDCAMS + IEBGENER + IF/THEN
//*
//CATCHK  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT ENT('IBMUSER.COBOL.FILE80') ALL
/*
//*
//READMBR EXEC PGM=IEBGENER,COND=(0,NE,CATCHK)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//SYSUT2   DD DUMMY
//SYSIN    DD DUMMY
//*
//        IF (READMBR.RC = 0) THEN
//MSGOK   EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
IBMUSER.COBOL.FILE80(CLIENTE1) EXISTE Y ES LEGIBLE
/*
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
//        ENDIF
//
