IDENTIFICATION DIVISION.
PROGRAM-ID. ALL2.

DATA DIVISION.
WORKING-STORAGE SECTION.

COPY ALL2MP.

01  WS-RESP               PIC S9(8) COMP.
01  WS-CAMPO1             PIC X(30).
01  MI-COMMAREA           PIC X(8) VALUE 'ALL2CTX'.

PROCEDURE DIVISION.

0000-MAIN.
    IF EIBCALEN = 0
       PERFORM 1000-PRIMERA-VEZ
    ELSE
       PERFORM 2000-RECIBIR-MAPA
    END-IF

    PERFORM 9000-RETORNAR-CICS
    GOBACK.

1000-PRIMERA-VEZ.
    MOVE LOW-VALUES TO ALL2MPO.

    EXEC CICS SEND MAP('ALL2MP')
         MAPSET('ALL2MP')
         FROM(ALL2MPO)
         ERASE
    END-EXEC.

2000-RECIBIR-MAPA.
    MOVE LOW-VALUES TO ALL2MPI.

    EXEC CICS RECEIVE MAP('ALL2MP')
         MAPSET('ALL2MP')
         INTO(ALL2MPI)
         RESP(WS-RESP)
    END-EXEC.

    EVALUATE WS-RESP
       WHEN DFHRESP(NORMAL)
            PERFORM 3000-PROCESO-NORMAL
       WHEN DFHRESP(MAPFAIL)
            PERFORM 4000-FALLO-MAPA
       WHEN OTHER
            PERFORM 5000-ERROR-RECIBIR
    END-EVALUATE.

3000-PROCESO-NORMAL.
    MOVE CAMPO1I TO WS-CAMPO1.
    MOVE LOW-VALUES TO ALL2MPO.

    MOVE 'OK' TO CAMPO1O.
    MOVE WS-CAMPO1 TO CAMPO2O.
    MOVE 'ESTOY PSEUDOCONVERSANDO DESDE CICS'
         TO MSGO.

    PERFORM 8000-ENVIAR-MAPA.

4000-FALLO-MAPA.
    MOVE LOW-VALUES TO ALL2MPO.

    MOVE 'NO ME HAGAS TRABAJAR EN BALDE'
         TO MSGO.

    PERFORM 8000-ENVIAR-MAPA.

5000-ERROR-RECIBIR.
    MOVE LOW-VALUES TO ALL2MPO.

    MOVE 'ERROR EN RECEIVE MAP'
         TO MSGO.

    PERFORM 8000-ENVIAR-MAPA.

8000-ENVIAR-MAPA.
    EXEC CICS SEND MAP('ALL2MP')
         MAPSET('ALL2MP')
         FROM(ALL2MPO)
         ERASE
    END-EXEC.

9000-RETORNAR-CICS.
    EXEC CICS RETURN
         TRANSID('ALL2')
         COMMAREA(MI-COMMAREA)
         LENGTH(8)
    END-EXEC.
