//VRYALL  JOB (ACCT),'PARMVRY C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMVRY
//* FUENTE : IBMUSER.COBOL.SRC(PARMVRY)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMVRY)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMVRY),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMVRY),DISP=SHR
//*
//RUN     EXEC PGM=PARMVRY,COND=(4,LT)
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
MENSAJE CON PERFORM VARYING DESDE SYSIN
/*
//
