//MFLMAP   JOB (ACCT),'CICS MFL BMS',CLASS=A,MSGCLASS=X
//*
//* ASSEMBLE MFL BMS MAPSET
//* INPUT   : IBMUSER.CICS.MAPS(MFLSET)
//* LOAD    : IBMUSER.CICS.LOAD(MFLSET)
//* COPY    : IBMUSER.CICS.COPY(MFLSET)
//*
//MAPASM   EXEC PGM=ASMA90,PARM='OBJECT,SYSPARM(MAP)'
//SYSLIB   DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=&&MAPOBJ,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(MOD,PASS)
//SYSIN    DD DSN=IBMUSER.CICS.MAPS(MFLSET),DISP=SHR
//*
//LINKMAP  EXEC PGM=IEWL,COND=(0,NE,MAPASM),
//         PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIN   DD DSN=&&MAPOBJ,DISP=(OLD,DELETE)
//SYSLMOD  DD DSN=IBMUSER.CICS.LOAD(MFLSET),DISP=SHR
//*
//DSECT    EXEC PGM=ASMA90,COND=(0,NE,LINKMAP),
//         PARM='DECK,NOBJECT,SYSPARM(DSECT)'
//SYSLIB   DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD DSN=IBMUSER.CICS.COPY(MFLSET),DISP=SHR
//SYSIN    DD DSN=IBMUSER.CICS.MAPS(MFLSET),DISP=SHR
