IDENTIFICATION DIVISION.
PROGRAM-ID. PARMPRC.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  W-MES                 PIC X(80).

PROCEDURE DIVISION.
    PERFORM 1000-INICIO.
    PERFORM 2000-PROCESO.
    PERFORM 3000-FIN.

1000-INICIO.
    DISPLAY 'INICIO DEL PROGRAMA'.

2000-PROCESO.
    ACCEPT W-MES.
    DISPLAY 'TEXTO RECIBIDO DESDE SYSIN:'.
    DISPLAY W-MES.

3000-FIN.
    STOP RUN.
