IDENTIFICATION DIVISION.
PROGRAM-ID. PARMTHR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  W-MES                 PIC X(80).

PROCEDURE DIVISION.
    PERFORM 1000-INICIO THRU 1000-INICIO-F.
    PERFORM 2000-PROCESO THRU 2000-PROCESO-F.
    PERFORM 3000-FIN THRU 3000-FIN-F.

1000-INICIO.
    DISPLAY 'INICIO DEL PROGRAMA'.
1000-INICIO-F.
    EXIT.

2000-PROCESO.
    ACCEPT W-MES.
    DISPLAY 'TEXTO RECIBIDO DESDE SYSIN:'.
    DISPLAY W-MES.
2000-PROCESO-F.
    EXIT.

3000-FIN.
    STOP RUN.
3000-FIN-F.
    EXIT.
