//BNDA4DB JOB (ACCT),'BIND ALL4P',CLASS=A,MSGCLASS=X
//* BIND PLAN DB2 PARA PROGRAMA CICS ALL4
//* DBRM : IBMUSER.DB2LAB.DBRMLIB(ALL4)
//* PLAN : ALL4P
//* SSID : DB9G
//BIND    EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB DD DSN=DSN910.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN DD *
 DSN SYSTEM(DB9G)
 BIND PLAN(ALL4P) -
      MEMBER(ALL4) -
      LIBRARY('IBMUSER.DB2LAB.DBRMLIB') -
      ACTION(REPLACE) -
      ISOLATION(CS) -
      VALIDATE(BIND) -
      OWNER(IBMUSER) -
      QUALIFIER(IBMUSER)
 END
/*
