//CMPA4DB JOB (ACCT),'CICS DB2 ALL4',CLASS=A,MSGCLASS=X
//* COMPILE PROGRAM ALL4 WITH DB2 PRECOMPILE + CICS TRANSLATE + COBOL + LKED
//PCDB2   EXEC PGM=DSNHPC,
//             PARM='HOST(IBMCOB),APOST'
//STEPLIB DD DSN=DSN910.SDSNLOAD,DISP=SHR
//SYSLIB  DD DSN=DSN910.SDSNMACS,DISP=SHR
//        DD DSN=IBMUSER.CICS.COPY,DISP=SHR
//DBRMLIB DD DSN=IBMUSER.DB2LAB.DBRMLIB(ALL4),DISP=SHR
//SYSCIN  DD DSN=&&PCOUT,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(NEW,PASS)
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSTERM DD SYSOUT=*
//SYSIN   DD DSN=IBMUSER.CICS.SRC(ALL4),DISP=SHR
//*
//TRNCICS EXEC PGM=DFHECP1$,COND=(4,LT,PCDB2),
//             PARM='COBOL2'
//STEPLIB DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//SYSPUNCH DD DSN=&&TRNOUT,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(NEW,PASS)
//SYSPRINT DD SYSOUT=*
//SYSIN   DD DSN=&&PCOUT,DISP=(OLD,DELETE)
//*
//COBOL   EXEC PGM=IGYCRCTL,COND=(4,LT,TRNCICS),
//             PARM='LIB,OBJECT,APOST'
//STEPLIB DD DSN=IGY420.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN  DD DSN=&&OBJ,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(NEW,PASS)
//SYSLIB  DD DSN=IBMUSER.CICS.COPY,DISP=SHR
//        DD DSN=DFH410.CICS.SDFHCOB,DISP=SHR
//SYSIN   DD DSN=&&TRNOUT,DISP=(OLD,DELETE)
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT5  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT6  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT7  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT8  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT9  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//*
//LKED    EXEC PGM=IEWL,COND=(4,LT,COBOL),
//             PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIB  DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//        DD DSN=DSN910.SDSNLOAD,DISP=SHR
//        DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN  DD DSN=&&OBJ,DISP=(OLD,DELETE)
//        DD *
 INCLUDE SYSLIB(DFHEAI)
 INCLUDE SYSLIB(DFHEAI0)
 INCLUDE SYSLIB(DSNCLI)
 ENTRY ALL4
 NAME ALL4(R)
//SYSLMOD DD DSN=IBMUSER.CICS.LOAD(ALL4),DISP=SHR
//
