IDENTIFICATION DIVISION.
PROGRAM-ID. PARMLOP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  W-MES                 PIC X(80).
01  W-CONTADOR            PIC 9(02).

PROCEDURE DIVISION.
    PERFORM 1000-INICIO.
    PERFORM 2000-PROCESO UNTIL W-CONTADOR = 5.
    PERFORM 3000-FIN.

1000-INICIO.
    MOVE 0 TO W-CONTADOR.
    ACCEPT W-MES.
    DISPLAY 'INICIO DEL PROGRAMA PARMLOP'.

2000-PROCESO.
    DISPLAY W-MES.
    ADD 1 TO W-CONTADOR.

3000-FIN.
    STOP RUN.
