ALL4MP   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL
ALL4MP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,72),LENGTH=6,ATTRB=ASKIP,INITIAL='ALL4MP'
         DFHMDF POS=(3,20),LENGTH=12,ATTRB=ASKIP,INITIAL='CLIENTES DB2'
         DFHMDF POS=(8,10),LENGTH=4,ATTRB=ASKIP,INITIAL='DNI:'
DNI      DFHMDF POS=(8,20),LENGTH=9,ATTRB=(UNPROT,IC)
         DFHMDF POS=(10,10),LENGTH=7,ATTRB=ASKIP,INITIAL='NOMBRE:'
NOMBRE   DFHMDF POS=(10,20),LENGTH=20,ATTRB=ASKIP
         DFHMDF POS=(12,10),LENGTH=10,ATTRB=ASKIP,INITIAL='APELLIDOS:'
APELLID  DFHMDF POS=(12,22),LENGTH=30,ATTRB=ASKIP
         DFHMDF POS=(14,10),LENGTH=10,ATTRB=ASKIP,INITIAL='DIRECCION:'
DIRECCI  DFHMDF POS=(14,22),LENGTH=35,ATTRB=ASKIP
         DFHMDF POS=(20,10),LENGTH=8,ATTRB=ASKIP,INITIAL='MENSAJE:'
MSG      DFHMDF POS=(20,20),LENGTH=50,ATTRB=ASKIP
         DFHMSD TYPE=FINAL
         END
