//CMPHOLA JOB (ACCT),'COMPILE HOLA',CLASS=A,MSGCLASS=X
//*
//* TRADUCE, COMPILA Y LINK-EDITA HOLA COBOL CICS
//* FUENTE : IBMUSER.CICS.SRC(HOLA)
//* LOAD   : IBMUSER.CICS.LOAD(HOLA)
//*
//TRN     EXEC PGM=DFHECP1$,PARM='COBOL2'
//STEPLIB  DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=IBMUSER.CICS.SRC(HOLA),DISP=SHR
//SYSPUNCH DD UNIT=SYSDA,SPACE=(TRK,(1,1)),DISP=(,PASS)
//*
//COBOL   EXEC PGM=IGYCRCTL,PARM='LIB,OBJECT,RENT,NODYNAM'
//STEPLIB  DD DSN=IGY420.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=*.TRN.SYSPUNCH,DISP=(OLD,DELETE)
//SYSLIB   DD DSN=IBMUSER.CICS.COPY,DISP=SHR
//SYSLIN   DD UNIT=SYSDA,SPACE=(TRK,(1,1)),DISP=(,PASS)
//SYSUT1   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT5   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT6   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSUT7   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//*
//LKED    EXEC PGM=IEWL,PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSLIB   DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLMOD  DD DSN=IBMUSER.CICS.LOAD(HOLA),DISP=SHR
//SYSLIN   DD DSN=*.COBOL.SYSLIN,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFHELII)
 NAME HOLA(R)
/*
//
