//CMPMAP JOB (ACCT),'COMPILE BMS MAP',CLASS=A,MSGCLASS=X
//*
//* ENSAMBLA MAPA BMS HOLAMP
//* ENTRADA : IBMUSER.CICS.MAPS(HOLAMP)
//* LOAD    : IBMUSER.CICS.LOAD(HOLAMP)
//* COPY    : IBMUSER.CICS.COPY(HOLAMP)
//*
//MAPASM  EXEC PGM=ASMA90,PARM='OBJECT,SYSPARM(MAP)'
//SYSLIB  DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN  DD DSN=&&MAPOBJ,UNIT=SYSDA,
//           SPACE=(CYL,(1,1)),DISP=(MOD,PASS)
//SYSIN   DD DSN=IBMUSER.CICS.MAPS(HOLAMP),DISP=SHR
//*
//LINKMAP EXEC PGM=IEWL,COND=(0,NE,MAPASM),
//           PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIN  DD DSN=&&MAPOBJ,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=IBMUSER.CICS.LOAD(HOLAMP),DISP=SHR
//*
//DSECT   EXEC PGM=ASMA90,COND=(0,NE,LINKMAP),
//           PARM='DECK,NOOBJECT,SYSPARM(DSECT)'
//SYSLIB  DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD DSN=IBMUSER.CICS.COPY(HOLAMP),DISP=SHR
//SYSIN   DD DSN=IBMUSER.CICS.MAPS(HOLAMP),DISP=SHR
//
