//CRCICS JOB (ACCT),'CREATE CICS LIBS',CLASS=A,MSGCLASS=X
//*
//* CREA LIBRERIAS PRIVADAS PARA LAB COBOL/CICS/BMS
//* NO TOCA LIBRERIAS DE PRODUCTO DFH410.CICS.*
//*
//MAPS    EXEC PGM=IEFBR14
//DD1     DD DSN=IBMUSER.CICS.MAPS,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(2,1,20)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//COPY    EXEC PGM=IEFBR14
//DD1     DD DSN=IBMUSER.CICS.COPY,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(2,1,20)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//SRC     EXEC PGM=IEFBR14
//DD1     DD DSN=IBMUSER.CICS.SRC,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(2,1,20)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//LOAD    EXEC PGM=IEFBR14
//DD1     DD DSN=IBMUSER.CICS.LOAD,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(CYL,(1,1,20)),
//           DCB=(DSORG=PO,RECFM=U,BLKSIZE=32760)
//*
//JCLLIB  EXEC PGM=IEFBR14
//DD1     DD DSN=IBMUSER.CICS.JCL,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(2,1,20)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//
