//DCALL   JOB (ACCT),'PARMDEC C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMDEC
//* FUENTE : IBMUSER.COBOL.SRC(PARMDEC)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMDEC)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMDEC),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMDEC),DISP=SHR
//*
//RUN     EXEC PGM=PARMDEC,COND=(0,NE)
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
MENSAJE CON CONTADOR DESCENDENTE DESDE SYSIN
/*
//
