//OMT400  JOB (ACCT),'SORT OMIT >=400',CLASS=A,MSGCLASS=X
//*
//* OMITE CLIENTES CON IMPORTE MAYOR O IGUAL A 400
//* ENTRADA : IBMUSER.COBOL.FILE80(CLIENTE1)
//* SALIDA  : IBMUSER.COBOL.FILE80(CLI399)
//* UTILIDAD: DFSORT
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLI399),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=COPY
  OMIT COND=(36,8,CH,GE,C'00000400')
  OUTREC FIELDS=(DATE,C' ',8,12,C' $',36,8)
/*
//
