//SEL600  JOB (ACCT),'SORT SELECT <600',CLASS=A,MSGCLASS=X
//*
//* SELECCIONA CLIENTES CON IMPORTE MENOR A 600
//* ENTRADA : IBMUSER.COBOL.FILE80(CLIENTE1)
//* SALIDA  : IBMUSER.COBOL.FILE80(CLI600)
//* UTILIDAD: DFSORT
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLI600),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=COPY
  INCLUDE COND=(36,8,CH,LT,C'00000600')
  OUTREC FIELDS=(DATE1,C' ',8,12,C' $',36,8)
/*
//
