//CTLALL  JOB (ACCT),'PARMCTL C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMCTL
//* FUENTE : IBMUSER.COBOL.SRC(PARMCTL)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMCTL)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMCTL),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMCTL),DISP=SHR
//*
//RUN     EXEC PGM=PARMCTL,COND=(4,LT)
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
+PRIMER MENSAJE DESDE SYSIN
+SEGUNDO MENSAJE DESDE SYSIN
+TERCER MENSAJE DESDE SYSIN
%
/*
//
