       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARMTMS.

       PROCEDURE DIVISION.
           PERFORM 1000-INICIO.
           PERFORM 2000-PROCESO 4 TIMES.
           PERFORM 3000-FIN.

       1000-INICIO.
           DISPLAY 'INICIO DEL PROGRAMA PARMTMS'.

       2000-PROCESO.
           PERFORM 2100-IMPRIME-TEXTO 2 TIMES.

       2100-IMPRIME-TEXTO.
           PERFORM 5 TIMES
              DISPLAY 'HOLA'
              DISPLAY 'HOLA OTRA VEZ'
              DISPLAY 'HOLA DE NUEVO'
           END-PERFORM.

       3000-FIN.
           DISPLAY 'FIN DEL PROGRAMA PARMTMS'.
           STOP RUN.
