//CRDB2WK JOB (ACCT),'CREATE DB2 LAB',CLASS=A,MSGCLASS=X
//*
//* CREA LIBRERIAS BASE PARA LAB CICS/DB2
//* NO CREA OBJETOS DB2. SOLO DATASETS DE TRABAJO.
//*
//ALLOC   EXEC PGM=IEFBR14
//*
//SPUFI   DD DSN=IBMUSER.DB2LAB.SPUFI,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2,10)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//*
//DCLGEN  DD DSN=IBMUSER.DB2LAB.DCLGEN,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2,10)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//*
//DBRMLIB DD DSN=IBMUSER.DB2LAB.DBRMLIB,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2,10)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//*
//BINDLIB DD DSN=IBMUSER.DB2LAB.BIND,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2,10)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//*
//OUTLIB  DD DSN=IBMUSER.DB2LAB.OUT,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2,10)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=27920)
//*
//SPUFO   DD DSN=IBMUSER.DB2LAB.SPUFO,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(3,2)),
//           DCB=(DSORG=PS,RECFM=VB,LRECL=4092,BLKSIZE=4096)
//
