       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY 'WELCOME TO IBMUSER COBOL'.
           STOP RUN.
