       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  W-MES                 PIC X(80).
       PROCEDURE DIVISION.
           ACCEPT W-MES.
           DISPLAY W-MES.
           STOP RUN.
