ALL2MP   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,                   X
               STORAGE=AUTO,CTRL=FREEKB,TIOAPFX=YES
ALL2MP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,72),LENGTH=6,ATTRB=(ASKIP,NORM),                X
               INITIAL='ALL2MP'
         DFHMDF POS=(3,10),LENGTH=43,ATTRB=(ASKIP,BRT),                X
               INITIAL='PROGRAMA ALL2 PSEUDOCONVERSACIONAL'
         DFHMDF POS=(10,1),LENGTH=7,ATTRB=(ASKIP,NORM),                X
               INITIAL='CAMPO1:'
CAMPO1   DFHMDF POS=(10,10),LENGTH=30,ATTRB=(UNPROT,NORM,IC)
         DFHMDF POS=(11,1),LENGTH=7,ATTRB=(ASKIP,NORM),                X
               INITIAL='CAMPO2:'
CAMPO2   DFHMDF POS=(11,10),LENGTH=30,ATTRB=(UNPROT,NORM)
         DFHMDF POS=(20,1),LENGTH=8,ATTRB=(ASKIP,NORM),                X
               INITIAL='MENSAJE:'
MSG      DFHMDF POS=(20,10),LENGTH=60,ATTRB=(ASKIP,BRT)
         DFHMSD TYPE=FINAL
         END
