//TMSALL  JOB (ACCT),'PARMTMS C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMTMS
//* FUENTE : IBMUSER.COBOL.SRC(PARMTMS)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMTMS)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMTMS),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMTMS),DISP=SHR
//*
//RUN     EXEC PGM=PARMTMS,COND=(4,LT)
//STEPLIB DD DSN=*.BUILD.LKED.SYSLMOD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//
