//CATCLI  JOB (ACCT),'CONCAT CLIENTES',CLASS=A,MSGCLASS=X
//*
//* CONCATENA CLIENTE1 + CLIENTE2 EN CLIENTE3
//* UTILITARIO: IEBGENER
//*
//STEP01  EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//         DD DSN=IBMUSER.COBOL.FILE80(CLIENTE2),DISP=SHR
//SYSUT2   DD DSN=IBMUSER.COBOL.FILE80(CLIENTE3),DISP=SHR
//SYSIN    DD DUMMY
//
