//CRFILE8 JOB (ACCT),'CREATE FILE80',CLASS=A,MSGCLASS=X
//*
//* CREA LIBRERIA PARA ARCHIVOS DE 80 BYTES
//* LAB: IDCAMS + IEBGENER + SORT
//*
//STEP01  EXEC PGM=IEFBR14
//FILE80  DD DSN=IBMUSER.COBOL.FILE80,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(1,1,5)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//
