//SORTCLI JOB (ACCT),'SORT CLIENTES',CLASS=A,MSGCLASS=X
//*
//* VERSION CON ERROR DOCUMENTADO
//* ERROR: LA SEGUNDA DD SE DEFINIO COMO SORTIN EN VEZ DE SORTOUT
//* RESULTADO ESPERADO: ICE056A SORTOUT NOT DEFINED / COND CODE 0016
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE3),DISP=SHR
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=(8,12,CH,A)
/*
//
