//SORTCLI JOB (ACCT),'SORT CLIENTES',CLASS=A,MSGCLASS=X
//*
//* ORDENA CLIENTE3 POR APELLIDO Y DEJA RESULTADO EN CLIENTE
//* UTILITARIO: SORT
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE3),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLIENTE),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=(8,12,CH,A)
/*
//
