//CMPALL2 JOB (ACCT),'COMPILE ALL2',CLASS=A,MSGCLASS=X
//*
//* TRADUCE, COMPILA Y LINK-EDITA COBOL CICS ALL2
//* FUENTE : IBMUSER.CICS.SRC(ALL2)
//* COPY   : IBMUSER.CICS.COPY(ALL2MP)
//* LOAD   : IBMUSER.CICS.LOAD(ALL2)
//*
//TRN     EXEC PGM=DFHECP1$,PARM='COBOL2'
//STEPLIB DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN   DD DSN=IBMUSER.CICS.SRC(ALL2),DISP=SHR
//SYSLIB  DD DSN=IBMUSER.CICS.COPY,DISP=SHR
//SYSPUNCH DD DSN=&&TRNSRC,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(,PASS)
//*
//COBOL   EXEC PGM=IGYCRCTL,COND=(4,LT,TRN),
//            PARM='LIB,OBJECT,RENT,NODYNAM'
//STEPLIB DD DSN=IGY420.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN   DD DSN=&&TRNSRC,DISP=(OLD,DELETE)
//SYSLIB  DD DSN=IBMUSER.CICS.COPY,DISP=SHR
//        DD DSN=DFH410.CICS.SDFHCOB,DISP=SHR
//SYSLIN  DD DSN=&&OBJMOD,UNIT=SYSDA,
//            SPACE=(CYL,(1,1)),DISP=(,PASS)
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT5  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT6  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT7  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//*
//LKED    EXEC PGM=IEWL,COND=(4,LT,COBOL),
//            PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1  DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIB  DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//        DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLMOD DD DSN=IBMUSER.CICS.LOAD(ALL2),DISP=SHR
//SYSLIN  DD DSN=&&OBJMOD,DISP=(OLD,DELETE)
//        DD *
  INCLUDE SYSLIB(DFHELII)
  NAME ALL2(R)
/*
//
