//CRDATA  JOB (ACCT),'CREATE DATA',CLASS=A,MSGCLASS=X
//*
//* CREA LIBRERIA DE DATOS PARA ARCHIVOS COBOL
//* DESTINO PARA FILE TRANSFER:
//*   IBMUSER.COBOL.DATA(ARCHI)
//*
//STEP01  EXEC PGM=IEFBR14
//COBDATA DD DSN=IBMUSER.COBOL.DATA,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(1,1,5)),
//           DCB=(DSORG=PO,RECFM=FB,LRECL=43,BLKSIZE=430)
//
