DEFINE PROGRAM(ALL2) GROUP(LAB21) LANGUAGE(COBOL)
DEFINE MAPSET(ALL2MP) GROUP(LAB21)
DEFINE TRANSACTION(ALL2) GROUP(LAB21) PROGRAM(ALL2)
DEFINE LIBRARY(LAB21LIB) GROUP(LAB21) DSNAME01(IBMUSER.CICS.LOAD)
INSTALL GROUP(LAB21)
