//CORTECL JOB (ACCT),'CONTROL BREAK',CLASS=A,MSGCLASS=X
//*
//* CORTE DE CONTROL POR APELLIDO
//* SUMARIZA IMPORTES DEL ARCHIVO CLIENTE
//* ENTRADA : IBMUSER.COBOL.FILE80(CLIENTE)
//* SALIDA  : IBMUSER.COBOL.FILE80(CLISUM)
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLISUM),DISP=OLD
//SYSIN   DD *
  SORT FIELDS=(8,12,CH,A)
  SUM FIELDS=(36,8,ZD)
  OUTREC FIELDS=(8,28,36,8)
/*
//
