//INREC2  JOB (ACCT),'DFSORT IFTHEN',CLASS=A,MSGCLASS=X
//*
//* MARCA REGISTROS COMO MENOR/MAYOR SEGUN IMPORTE
//* ENTRADA : IBMUSER.COBOL.FILE80(CLIENTE1)
//* SALIDA  : IBMUSER.COBOL.FILE80(CLIFLG)
//* UTILIDAD: DFSORT
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLIFLG),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=(1,7,ZD,A)
  INREC IFTHEN=(WHEN=(36,8,ZD,LT,400),
                OVERLAY=(47:C'MENOR')),
        IFTHEN=(WHEN=NONE,
                OVERLAY=(47:C'MAYOR'))
/*
//
