//INREC1  JOB (ACCT),'DFSORT INREC BUILD',CLASS=A,MSGCLASS=X
//*
//* FORMATEA REGISTROS CON INREC BUILD
//* ENTRADA : IBMUSER.COBOL.FILE80(CLIENTE1)
//* SALIDA  : IBMUSER.COBOL.FILE80(CLIINR)
//* UTILIDAD: DFSORT
//*
//STEP01  EXEC PGM=SORT
//SYSOUT  DD SYSOUT=*
//SORTIN  DD DSN=IBMUSER.COBOL.FILE80(CLIENTE1),DISP=SHR
//SORTOUT DD DSN=IBMUSER.COBOL.FILE80(CLIINR),DISP=SHR
//SYSIN   DD *
  SORT FIELDS=(1,7,ZD,A)
  INREC BUILD=(1,7,C' ',8,12,C'-$-',36,8,C' ',28,7,C'-',DATE1)
/*
//
