//CMPPRU3 JOB (ACCT),'COMPILE PRUEBA3',CLASS=A,MSGCLASS=X
//*
//* COMPILA Y LINK-EDITA PROGRAMA COBOL PRUEBA3
//* FUENTE : IBMUSER.COBOL.SRC(PRUEBA3)
//* LOAD   : IBMUSER.COBOL.LOAD(PRUEBA3)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PRUEBA3),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PRUEBA3),DISP=SHR
//
