//CRIN50  JOB (ACCT),'CREATE ENTR50',CLASS=A,MSGCLASS=X
//*
//* CREA FICHERO SECUENCIAL DE ENTRADA PARA COBOL
//* DATASET : IBMUSER.COBOL.ENTR50
//* FORMATO : FB 50
//*
//STEP01  EXEC PGM=IEFBR14
//ENTRADA DD DSN=IBMUSER.COBOL.ENTR50,
//           DISP=(NEW,CATLG,DELETE),
//           UNIT=SYSDA,
//           SPACE=(TRK,(1,1)),
//           DCB=(DSORG=PS,RECFM=FB,LRECL=50,BLKSIZE=500)
//
