//RUNPRU3 JOB (ACCT),'RUN PRUEBA3',CLASS=A,MSGCLASS=X
//*
//* EJECUTA PRUEBA3 LEYENDO UN FICHERO SECUENCIAL
//* PROGRAMA : IBMUSER.COBOL.LOAD(PRUEBA3)
//* ENTRADA  : IBMUSER.COBOL.ENTR50
//* DDNAME   : ENTRADA
//*
//STEP01  EXEC PGM=PRUEBA3
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//ENTRADA DD DSN=IBMUSER.COBOL.ENTR50,DISP=SHR
//SYSOUT  DD SYSOUT=*
//
