//CMPPRC  JOB (ACCT),'PARMPRC C-L',CLASS=A,MSGCLASS=X
//*
//* COMPILA Y LINK-EDITA EL PROGRAMA PARMPRC
//* FUENTE : IBMUSER.COBOL.SRC(PARMPRC)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMPRC)
//*
//COBRUN   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMPRC),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMPRC),DISP=SHR
//
