//RUNPRC  JOB (ACCT),'RUN PARMPRC',CLASS=A,MSGCLASS=X
//*
//* EJECUTA PARMPRC Y ENVIA UNA LINEA POR SYSIN
//*
//STEP01  EXEC PGM=PARMPRC
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
ESTE TEXTO VIENE DESDE EL JCL
/*
//
