//THRALL  JOB (ACCT),'PARMTHR C-L-R',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA PARMTHR
//* FUENTE : IBMUSER.COBOL.SRC(PARMTHR)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMTHR)
//*
//BUILD   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMTHR),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMTHR),DISP=SHR
//*
//RUN     EXEC PGM=PARMTHR,COND=(0,NE)
//STEPLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
ESTE TEXTO VIENE DESDE EL JCL THRU
/*
//
