//CMPARM  JOB (ACCT),'PARMES C-L',CLASS=A,MSGCLASS=X
//*
//* COMPILA Y LINK-EDITA EL PROGRAMA PARMES
//* FUENTE : IBMUSER.COBOL.SRC(PARMES)
//* LOAD   : IBMUSER.COBOL.LOAD(PARMES)
//*
//COBRUN   EXEC IGYWCL,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(PARMES),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(PARMES),DISP=SHR
