//CMPHELLO JOB (ACCT),'HELLO COBOL',CLASS=A,MSGCLASS=X
//*
//* COMPILA, LINK-EDITA Y EJECUTA EL PROGRAMA COBOL HELLO
//* FUENTE : IBMUSER.COBOL.SRC(HELLO)
//* LOAD   : IBMUSER.COBOL.LOAD(HELLO)
//*
//COBRUN   EXEC IGYWCLG,LNGPRFX='IGY420'
//COBOL.SYSIN DD DSN=IBMUSER.COBOL.SRC(HELLO),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.COBOL.LOAD(HELLO),DISP=SHR
//GO.SYSOUT DD SYSOUT=*
