//CRCOBOL JOB (ACCT),'COBOL LIBS',CLASS=A,MSGCLASS=X
//*
//* CREA LIBRERIAS COBOL PARA PRACTICAS CONTROLADAS
//* NO TOCA SYS1.*
//*
//STEP01   EXEC PGM=IEFBR14
//*
//SRC      DD DSN=IBMUSER.COBOL.SRC,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(3,2,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=800)
//*
//LOAD     DD DSN=IBMUSER.COBOL.LOAD,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(5,2,10)),
//            DCB=(DSORG=PO,RECFM=U,BLKSIZE=32760)
