//RUNPARM JOB (ACCT),'RUN PARMES',CLASS=A,MSGCLASS=X
//*
//* EJECUTA PARMES Y PASA UN DATO POR SYSIN
//* PROGRAMA: IBMUSER.COBOL.LOAD(PARMES)
//*
//STEP01   EXEC PGM=PARMES
//STEPLIB  DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
DICIEMBRE
/*
